# DS-SF-27 | Codealong 02 | Research Design and `pandas`

## Part A - Introduction to `pandas` with the SF Housing dataset

> ### Set up the environment

In [1]:
import os

import pandas as pd
pd.set_option('display.max_rows', 8)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

> ### Load data from files and the Web

`pandas` provides powerful facilities for easy retrieval of data from a variety of data sources.  In particular, it provides built-in support for loading data in `.csv` format, a common means of storing structured data in text files.

In [2]:
df = pd.read_csv(os.path.join('..', 'datasets', 'zillow-02-starter.csv'))

> Let's verify the type of `df`:

In [3]:
# TODO
type(df)

pandas.core.frame.DataFrame

The result is a `DataFrame`.  A `DataFrame` stores tabular data:

In [4]:
df

,ID,Address,Latitude,Longitude,DateOfSale,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
0,15063471,"55 Vandewater St APT 9, San Francisco, CA",37805103,-122412856,12/4/15,...,550.0,sqft,NaN,NaN,1980.0
1,15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,...,1430.0,sqft,2435.0,sqft,1948.0
2,15063609,"819 Francisco St, San Francisco, CA",37803728,-122419055,11/12/15,...,2040.0,sqft,3920.0,sqft,1976.0
3,15064044,"199 Chestnut St APT 5, San Francisco, CA",37804392,-122406590,12/11/15,...,1060.0,sqft,NaN,NaN,1930.0
...,...,...,...,...,...,...,...,...,...,...,...
996,2126960082,"355 1st St UNIT 1905, San Francisco, CA",37787029,-122393638,11/20/15,...,691.0,sqft,NaN,NaN,2004.0
997,2128308939,"33 Santa Cruz Ave, San Francisco, CA",37709136,-122465332,12/10/15,...,1738.0,sqft,2299.0,sqft,1976.0
998,2131957929,"1821 Grant Ave, San Francisco, CA",37803760,-122408531,12/15/15,...,1048.0,sqft,NaN,NaN,1975.0
999,2136213970,"1200 Gough St, San Francisco, CA",37784770,-122424100,1/10/16,...,900.0,sqft,NaN,NaN,1966.0

> ### Shape of the `DataFrame`: number of rows and columns

In [5]:
df.shape

(1000, 15)

The first value is the number of rows, the second the number of columns.

In [6]:
df.shape[0]

1000

In [7]:
df.shape[1]

15

(you can also use the idiomatic `len` to get the number of rows)

In [8]:
len(df)

1000

> We can get the "names" of the rows of the `DataFrame` with the `index` property.

In [9]:
df.index

RangeIndex(start=0, stop=1000, step=1)

Here, rows are just numbered from 0 to 1,000 (excluded).

> We can also get the names of the different columns of the `DataFrame` with the `column` property.

In [10]:
df.columns

Index([u'ID', u'Address', u'Latitude', u'Longitude', u'DateOfSale',
       u'SalePrice', u'SalePriceUnit', u'IsAStudio', u'BedCount', u'BathCount',
       u'Size', u'SizeUnit', u'LotSize', u'LotSizeUnit', u'BuiltInYear'],
      dtype='object')

> ### Subsetting on columns of a `DataFrame`

Selecting data in specific columns of a `DataFrame` is performed by using the `[]` operator.

Passing a single integer, or a list of integers, to `[]` will perform a location based lookup of the columns.

> E.g., columns #5 and #6:

In [11]:
# TODO
df[[1,5,6]]

                                       Address  SalePrice SalePriceUnit
0    55 Vandewater St APT 9, San Francisco, CA  710000.00             $
1          740 Francisco St, San Francisco, CA       2.15            $M
2          819 Francisco St, San Francisco, CA       5.60            $M
3     199 Chestnut St APT 5, San Francisco, CA       1.50            $M
..                                         ...        ...           ...
996    355 1st St UNIT 1905, San Francisco, CA  860000.00             $
997       33 Santa Cruz Ave, San Francisco, CA  830000.00             $
998          1821 Grant Ave, San Francisco, CA  835000.00             $
999           1200 Gough St, San Francisco, CA  825000.00             $

[1000 rows x 3 columns]

> Let's check that the column subsetting returns a `DataFrame`:

In [12]:
# TODO
type(df[[5, 6]])

pandas.core.frame.DataFrame

A `DataFrame` can be made of a single column.

> E.g., column #7 only:

In [13]:
# TODO
df[[7]]

    IsAStudio
0       False
1       False
2       False
3       False
..        ...
996     False
997     False
998     False
999     False

[1000 rows x 1 columns]

If the values passed to `[]` are non-integers, the `DataFrame` will attempt to match them to those in the `columns` property.

In [14]:
df.columns

Index([u'ID', u'Address', u'Latitude', u'Longitude', u'DateOfSale',
       u'SalePrice', u'SalePriceUnit', u'IsAStudio', u'BedCount', u'BathCount',
       u'Size', u'SizeUnit', u'LotSize', u'LotSizeUnit', u'BuiltInYear'],
      dtype='object')

> Let's subset the `DataFrame` on columns `SalePrice` and `SalePriceUnit`:

In [15]:
# TODO
#df[[5, 6]]
df[[1,0]]

                                       Address          ID
0    55 Vandewater St APT 9, San Francisco, CA    15063471
1          740 Francisco St, San Francisco, CA    15063505
2          819 Francisco St, San Francisco, CA    15063609
3     199 Chestnut St APT 5, San Francisco, CA    15064044
..                                         ...         ...
996    355 1st St UNIT 1905, San Francisco, CA  2126960082
997       33 Santa Cruz Ave, San Francisco, CA  2128308939
998          1821 Grant Ave, San Francisco, CA  2131957929
999           1200 Gough St, San Francisco, CA  2136213970

[1000 rows x 2 columns]

However, you cannot mix integers and non-integers.  E.g.,

In [16]:
# "df[ ['SalePrice', 6] ]" errors out...  Try it!
df[[5, 6]]

     SalePrice SalePriceUnit
0    710000.00             $
1         2.15            $M
2         5.60            $M
3         1.50            $M
..         ...           ...
996  860000.00             $
997  830000.00             $
998  835000.00             $
999  825000.00             $

[1000 rows x 2 columns]

Not passing a list always results in a value based lookup of the column:

In [17]:
df['Address']

0      55 Vandewater St APT 9, San Francisco, CA
1            740 Francisco St, San Francisco, CA
2            819 Francisco St, San Francisco, CA
3       199 Chestnut St APT 5, San Francisco, CA
                         ...
996      355 1st St UNIT 1905, San Francisco, CA
997         33 Santa Cruz Ave, San Francisco, CA
998            1821 Grant Ave, San Francisco, CA
999             1200 Gough St, San Francisco, CA
Name: Address, dtype: object

> Let's double check that result is a `Series`:

In [18]:
# TODO
type(df['Address'])

pandas.core.series.Series

Columns can also be retrieved using "attribute access" as `DataFrame`s add a property for each column with the names of the properties as the names of the columns.  However, this won't work for columns that have spaces or dots in their name.

In [19]:
type(df[['Address']])

pandas.core.frame.DataFrame

> Let's check the value of `df`'s `Address` property:

In [20]:
# TODO
df.Address

0      55 Vandewater St APT 9, San Francisco, CA
1            740 Francisco St, San Francisco, CA
2            819 Francisco St, San Francisco, CA
3       199 Chestnut St APT 5, San Francisco, CA
                         ...
996      355 1st St UNIT 1905, San Francisco, CA
997         33 Santa Cruz Ave, San Francisco, CA
998            1821 Grant Ave, San Francisco, CA
999             1200 Gough St, San Francisco, CA
Name: Address, dtype: object

> Use the `name` property (not `columns`, that's for a `DataFrame`) to get the name of the variable stored inside it.

In [21]:
# TODO
df.Address.name

'Address'

To find the zero-based location of a column, use the `.get_loc()` method of the `columns` property.  E.g.,

In [22]:
df.columns.get_loc('BedCount')

8

In [23]:
df[ [df.columns.get_loc('BedCount')] ]

     BedCount
0         1.0
1         NaN
2         2.0
3         1.0
..        ...
996       1.0
997       3.0
998       2.0
999       1.0

[1000 rows x 1 columns]

> We should get the same output as subsetting a `DataFrame` on `BedCount`:

In [24]:
# TODO
df[[8]]

     BedCount
0         1.0
1         NaN
2         2.0
3         1.0
..        ...
996       1.0
997       3.0
998       2.0
999       1.0

[1000 rows x 1 columns]

> ### Subsetting on rows of a `DataFrame`; and values of a `DataFrame` using the index

#### Slice using the `[]` operator

> E.g., the first five rows:

In [25]:
# TODO
df[:2]

,ID,Address,Latitude,Longitude,DateOfSale,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
0,15063471,"55 Vandewater St APT 9, San Francisco, CA",37805103,-122412856,12/4/15,...,550.0,sqft,NaN,NaN,1980.0
1,15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,...,1430.0,sqft,2435.0,sqft,1948.0

> ### Select rows by index label and location: `.loc[]` and `.iloc[]`

Until now, the index of the `DataFrame` is a numerical starting from 0 but you can specify which column(s) should be in the index.  E.g., `ID`:

In [26]:
df = df.set_index('ID')
#df

In [27]:
df.index

Int64Index([  15063471,   15063505,   15063609,   15064044,   15064257,
              15064295,   15064391,   15064536,   15064640,   15064669,
            ...
            2108546010, 2114498518, 2121221385, 2121978635, 2122992200,
            2124214951, 2126960082, 2128308939, 2131957929, 2136213970],
           dtype='int64', name=u'ID', length=1000)

In [28]:
df

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15063471,"55 Vandewater St APT 9, San Francisco, CA",37805103,-122412856,12/4/15,710000.00,...,550.0,sqft,NaN,NaN,1980.0
15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,2.15,...,1430.0,sqft,2435.0,sqft,1948.0
15063609,"819 Francisco St, San Francisco, CA",37803728,-122419055,11/12/15,5.60,...,2040.0,sqft,3920.0,sqft,1976.0
15064044,"199 Chestnut St APT 5, San Francisco, CA",37804392,-122406590,12/11/15,1.50,...,1060.0,sqft,NaN,NaN,1930.0
...,...,...,...,...,...,...,...,...,...,...,...
2126960082,"355 1st St UNIT 1905, San Francisco, CA",37787029,-122393638,11/20/15,860000.00,...,691.0,sqft,NaN,NaN,2004.0
2128308939,"33 Santa Cruz Ave, San Francisco, CA",37709136,-122465332,12/10/15,830000.00,...,1738.0,sqft,2299.0,sqft,1976.0
2131957929,"1821 Grant Ave, San Francisco, CA",37803760,-122408531,12/15/15,835000.00,...,1048.0,sqft,NaN,NaN,1975.0
2136213970,"1200 Gough St, San Francisco, CA",37784770,-122424100,1/10/16,825000.00,...,900.0,sqft,NaN,NaN,1966.0

> E.g., row with index 15063505:

In [29]:
# TODO
df.loc[15063505]

Address        740 Francisco St, San Francisco, CA
Latitude                                  37804420
Longitude                               -122417389
DateOfSale                                11/30/15
                              ...
SizeUnit                                      sqft
LotSize                                       2435
LotSizeUnit                                   sqft
BuiltInYear                                   1948
Name: 15063505, dtype: object

Its name is its value in the index.

> E.g., rows with indices 15063505 and 15064044:

In [30]:
# TODO
df.loc[[15063505, 15064044]]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,2.15,...,1430.0,sqft,2435.0,sqft,1948.0
15064044,"199 Chestnut St APT 5, San Francisco, CA",37804392,-122406590,12/11/15,1.50,...,1060.0,sqft,NaN,NaN,1930.0

> E.g., rows #1 and #3:

In [31]:
# TODO
df.iloc[[1]]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15063505,"740 Francisco St, San Francisco, CA",37804420,-122417389,11/30/15,2.15,...,1430.0,sqft,2435.0,sqft,1948.0

> ### Scalar lookup by label or location using `.at[]` and `.iat[]`

Scalar values can be looked up by label using .at, by passing both the row label and then the column name/value.

> E.g., row with index 15064044 and column `DateOfSale`.

In [32]:
# TODO
#df.at[15064044, 'DateOfSale']
#df.at[15064044, 'Address']
df.at[15064044, "LotSize"]

nan

Scalar values can also be looked up by location using .iat by passing both the row location and then the column location.

> E.g., row #3 and column #3:

In [33]:
# TODO
df.iat[1,11]

2435.0

> ### Select rows of a `DataFrame` by Boolean selection

Rows can also be selected by using Boolean selection, using an array calculated from the result of applying a logical condition on the values in any of the columns.  This allows us to build more complicated selections than those based simply upon index labels or positions.

> E.g., what homes have been built before 1900?

In [34]:
# TODO
#df[df.BuiltInYear < 1900]
df[(df.BuiltInYear > 2010) & (df.Size < 1000)]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
115828655,"480 Mission Bay Blvd N UNIT 614, San Francisco...",37771155,-122389034,12/15/15,1.00,...,928.0,sqft,NaN,NaN,2012.0
117672217,"1840 Washington St APT 603, San Francisco, CA",37793212,-122423744,12/2/15,1.05,...,837.0,sqft,NaN,NaN,2012.0
119685072,"574 Natoma St APT 302, San Francisco, CA",37779014,-122409446,11/12/15,478000.00,...,370.0,sqft,NaN,NaN,2012.0
123174799,"1080 Sutter St APT 1003, San Francisco, CA",37788066,-122418065,11/25/15,770000.00,...,753.0,sqft,NaN,NaN,2013.0
...,...,...,...,...,...,...,...,...,...,...,...
125088462,"748 Innes Ave # 303, San Francisco, CA",37730567,-122372703,12/17/15,490000.00,...,775.0,sqft,NaN,NaN,2011.0
2100902229,"2299 Market St APT 502, San Francisco, CA",37764100,-122433000,12/3/15,915000.00,...,700.0,sqft,NaN,NaN,2013.0
2101505254,"333 Beale St, San Francisco, CA",37788280,-122392100,12/3/15,1.40,...,950.0,sqft,NaN,NaN,2015.0
2124214951,"412 Green St APT A, San Francisco, CA",37800040,-122406100,1/15/16,390000.00,...,264.0,sqft,NaN,NaN,2012.0

This results in a `Series` that can be used to subset on the rows which values are `True`.

> Let's subset on that `Series`:

In [35]:
# TODO
df[df.BuiltInYear < 1900 ][['Size']]

              Size
ID
15065140    1000.0
15076156    7375.0
15078536    1593.0
15078866    2430.0
...            ...
119684777   3006.0
123597223   1275.0
123597388   1212.0
2122992200  3655.0

[15 rows x 1 columns]

Multiple conditions can be put together.

> E.g., subset for `BuiltInYear` below 1900 and `Size` over 1500:

In [36]:
# TODO
#df[df.BuiltInYear < 1900]
df[(df.BuiltInYear < 1900) & (df.Size < 1500)]

,Address,Latitude,Longitude,DateOfSale,SalePrice,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15065140,"1407 Montgomery St APT 2, San Francisco, CA",37802299,-122404941,1/28/16,976000.00,...,1000.0,sqft,NaN,NaN,1870.0
15082108,"3016 Sacramento St, San Francisco, CA",37788970,-122442995,12/22/15,1.85,...,1408.0,sqft,NaN,NaN,1890.0
63197592,"3021 20th St, San Francisco, CA",37758878,-122411147,12/7/15,1.10,...,1267.0,sqft,NaN,NaN,1890.0
114318108,"1442 Grove St # A, San Francisco, CA",37775894,-122440467,12/24/15,675000.00,...,593.0,sqft,NaN,NaN,1890.0
123597223,"1954 Golden Gate Ave, San Francisco, CA",37778246,-122442763,11/24/15,1.10,...,1275.0,sqft,NaN,NaN,1895.0
123597388,"667 Shotwell St # A, San Francisco, CA",37757851,-122415629,2/10/16,775000.00,...,1212.0,sqft,NaN,NaN,1890.0

It is possible to subset on columns simultaneously.

> E.g., subset (a `DataFrame`) on `Address` for `BuiltInYear` below 1900 and `Size` over 1500:

In [37]:
# TODO
df[(df.BuiltInYear < 1900) & (df.Size < 1500)][['Address']]

                                               Address
ID
15065140   1407 Montgomery St APT 2, San Francisco, CA
15082108         3016 Sacramento St, San Francisco, CA
63197592               3021 20th St, San Francisco, CA
114318108         1442 Grove St # A, San Francisco, CA
123597223      1954 Golden Gate Ave, San Francisco, CA
123597388       667 Shotwell St # A, San Francisco, CA

> To get a `Series` instead of a `DataFrame`:

In [38]:
# TODO
df[(df.BuiltInYear < 1900) & (df.Size > 1500)].Address

ID
15076156               1533 Sutter St, San Francisco, CA
15078536               640 Steiner St, San Francisco, CA
15078866               753-755 Oak St, San Francisco, CA
15084954         1954 Golden Gate Ave, San Francisco, CA
                                 ...
15181209      1001 Diamond St # 1001A, San Francisco, CA
82785514           1394 Mcallister St, San Francisco, CA
119684777                967 Hayes St, San Francisco, CA
2122992200             129 Octavia St, San Francisco, CA
Name: Address, dtype: object

## Part B - Wrangling the SF Housing dataset (take 2) with `pandas`

In [40]:
df = pd.read_csv(os.path.join('..', 'datasets', 'zillow-02-starter.csv'), index_col = 'ID')

(`pd.read_csv` can load the dataset and set the index column for the `DataFrame` at the same time)

> ### Remove the `Latitude` and `Longitude` columns

In [44]:
df.drop(['Latitude', 'Longitude'], axis = 1, inplace = True)
#df.drop(['DateOfSale'], axis = 1, inplace = True)

In [45]:
df

,Address,SalePrice,SalePriceUnit,IsAStudio,BedCount,...,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,,
15063471,"55 Vandewater St APT 9, San Francisco, CA",710000.00,$,False,1.0,...,550.0,sqft,NaN,NaN,1980.0
15063505,"740 Francisco St, San Francisco, CA",2.15,$M,False,NaN,...,1430.0,sqft,2435.0,sqft,1948.0
15063609,"819 Francisco St, San Francisco, CA",5.60,$M,False,2.0,...,2040.0,sqft,3920.0,sqft,1976.0
15064044,"199 Chestnut St APT 5, San Francisco, CA",1.50,$M,False,1.0,...,1060.0,sqft,NaN,NaN,1930.0
...,...,...,...,...,...,...,...,...,...,...,...
2126960082,"355 1st St UNIT 1905, San Francisco, CA",860000.00,$,False,1.0,...,691.0,sqft,NaN,NaN,2004.0
2128308939,"33 Santa Cruz Ave, San Francisco, CA",830000.00,$,False,3.0,...,1738.0,sqft,2299.0,sqft,1976.0
2131957929,"1821 Grant Ave, San Francisco, CA",835000.00,$,False,2.0,...,1048.0,sqft,NaN,NaN,1975.0
2136213970,"1200 Gough St, San Francisco, CA",825000.00,$,False,1.0,...,900.0,sqft,NaN,NaN,1966.0

> ### `SalePrice`: scale all values to dollars

In [46]:
#df.SalePriceUnit.unique()
df.SalePriceUnit.unique()

array(['$', '$M'], dtype=object)

In [47]:
df_1 = df[df.SalePriceUnit == '$']

df_1 = df_1.drop('SalePriceUnit', axis = 1)
# Really a workaround as DataFrame.drop() with inplace = True issue warnings...

df_6 = df[df.SalePriceUnit == '$M']

df_6 = df_6.drop('SalePriceUnit', axis = 1)

# Replacing the content of a column
df_6.SalePrice = df_6.SalePrice * (10 ** 6)

# Adding rows to a DataFrame
# Concatenation of two DataFrame objects
df = pd.concat([df_1, df_6])

In [48]:
df

,Address,SalePrice,IsAStudio,BedCount,BathCount,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,
15063471,"55 Vandewater St APT 9, San Francisco, CA",710000.0,False,1.0,NaN,550.0,sqft,NaN,NaN,1980.0
15064257,"111 Chestnut St APT 403, San Francisco, CA",970000.0,False,2.0,2.0,1299.0,sqft,NaN,NaN,1993.0
15064295,"111 Chestnut St APT 702, San Francisco, CA",940000.0,False,2.0,2.0,1033.0,sqft,NaN,NaN,1993.0
15064391,"1821 Grant Ave APT 101, San Francisco, CA",835000.0,False,1.0,1.0,1048.0,sqft,NaN,NaN,1975.0
...,...,...,...,...,...,...,...,...,...,...
2108411930,"3500 19th St, San Francisco, CA",1730000.0,False,2.0,2.5,1500.0,sqft,NaN,NaN,2013.0
2108546010,"1738 Lombard St APT 4, San Francisco, CA",1400000.0,False,2.0,2.0,NaN,NaN,NaN,NaN,2004.0
2121221385,"925 Larkin St, San Francisco, CA",1430000.0,False,NaN,NaN,6600.0,sqft,NaN,NaN,1907.0
2122992200,"129 Octavia St, San Francisco, CA",2750000.0,True,NaN,NaN,3655.0,sqft,NaN,NaN,1883.0

In [49]:
df.sort_index()

,Address,SalePrice,IsAStudio,BedCount,BathCount,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,
15063471,"55 Vandewater St APT 9, San Francisco, CA",710000.0,False,1.0,NaN,550.0,sqft,NaN,NaN,1980.0
15063505,"740 Francisco St, San Francisco, CA",2150000.0,False,NaN,2.0,1430.0,sqft,2435.0,sqft,1948.0
15063609,"819 Francisco St, San Francisco, CA",5600000.0,False,2.0,3.5,2040.0,sqft,3920.0,sqft,1976.0
15064044,"199 Chestnut St APT 5, San Francisco, CA",1500000.0,False,1.0,1.0,1060.0,sqft,NaN,NaN,1930.0
...,...,...,...,...,...,...,...,...,...,...
2126960082,"355 1st St UNIT 1905, San Francisco, CA",860000.0,False,1.0,1.0,691.0,sqft,NaN,NaN,2004.0
2128308939,"33 Santa Cruz Ave, San Francisco, CA",830000.0,False,3.0,3.0,1738.0,sqft,2299.0,sqft,1976.0
2131957929,"1821 Grant Ave, San Francisco, CA",835000.0,False,2.0,2.0,1048.0,sqft,NaN,NaN,1975.0
2136213970,"1200 Gough St, San Francisco, CA",825000.0,False,1.0,1.0,900.0,sqft,NaN,NaN,1966.0

> ### `IsAStudio`: convert from a Boolean to a binary variable (i.e., 0 or 1)

In [50]:
# TODO
#df.IsAStudio.unique()
df.IsAStudio = df.IsAStudio * 1.0

In [51]:
df

,Address,SalePrice,IsAStudio,BedCount,BathCount,Size,SizeUnit,LotSize,LotSizeUnit,BuiltInYear
ID,,,,,,,,,,
15063471,"55 Vandewater St APT 9, San Francisco, CA",710000.0,0,1.0,NaN,550.0,sqft,NaN,NaN,1980.0
15064257,"111 Chestnut St APT 403, San Francisco, CA",970000.0,0,2.0,2.0,1299.0,sqft,NaN,NaN,1993.0
15064295,"111 Chestnut St APT 702, San Francisco, CA",940000.0,0,2.0,2.0,1033.0,sqft,NaN,NaN,1993.0
15064391,"1821 Grant Ave APT 101, San Francisco, CA",835000.0,0,1.0,1.0,1048.0,sqft,NaN,NaN,1975.0
...,...,...,...,...,...,...,...,...,...,...
2108411930,"3500 19th St, San Francisco, CA",1730000.0,0,2.0,2.5,1500.0,sqft,NaN,NaN,2013.0
2108546010,"1738 Lombard St APT 4, San Francisco, CA",1400000.0,0,2.0,2.0,NaN,NaN,NaN,NaN,2004.0
2121221385,"925 Larkin St, San Francisco, CA",1430000.0,0,NaN,NaN,6600.0,sqft,NaN,NaN,1907.0
2122992200,"129 Octavia St, San Francisco, CA",2750000.0,1,NaN,NaN,3655.0,sqft,NaN,NaN,1883.0

> ### `Size`

In [52]:
df.SizeUnit.unique()

array(['sqft', nan], dtype=object)

Size is either in square feet or missing.  Almost no work needed except to remove size unit.

In [53]:
df.drop('SizeUnit', axis = 1, inplace = True)

> ### `LotSize`: scale all values to square feet

In [54]:
df.LotSizeUnit.unique()

array([nan, 'sqft', 'ac'], dtype=object)

Lot sizes are either in square feet or in acres.  Let's convert them all to square feet.

> Group #1: the `na` values:

In [ ]:
df_na = df[df.LotSizeUnit.isnull()]
df_na = df_na.drop('LotSizeUnit', axis = 1)

df_na.shape[0]

> Group #2: the `sqft` values:

In [ ]:
# TODO (use df_sqft)
df_sqft = df[df.LotSizeUnit == 'sqft']
df_sqft = df_sqft.drop('LotSizeUnit', axis = 1)

df_sqft.shape[0]

> Group #3: the `ac` values:

In [ ]:
# TODO (use df_ac)
df_ac = df[df.LotSizeUnit == 'ac']
df_ac = df_ac.drop('LotSizeUnit', axis = 1)

df_ac.shape[0]

> Let's scale these `acre` values into `sqft`:

In [ ]:
# (1 acre = 43,560 sqft)

# TODO
df_ac.LotSize = df_ac.LotSize*43560

Let's now put everything back together...

In [ ]:
df = pd.concat([df_na, df_sqft, df_ac]).sort_index()

In [ ]:
df

> ### Save the `pandas` `DataFrame` to a `.csv` file

In [ ]:
df.to_csv(os.path.join('..', 'datasets', 'zillow-02.csv'), index_label = 'ID')